tutorials/DLbuoyantPimpleFoam/array_of_cylinders/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform $pressure;
    }
    front
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    back
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    bot
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    obstacle
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}

// ************************************************************************* //
