tutorials/DLbuoyantPimpleFoam/array_of_cylinders/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    bot
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    top
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    front
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    back
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    obstacle
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}