tutorials/DLbuoyantPimpleFoam/array_of_cylinders/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
    }
    pFinal
    {
        solver           GAMG;
        tolerance        1e-7;
        smoother         GaussSeidel;
    }


    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }
    UFinal
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        nSweeps          1;
    }

    rho
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }


    rhoFinal
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        nSweeps          1;
    }

    hFinal
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
    }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        nSweeps          1;
    }

    kFinal
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        nSweeps          1;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        smoother         GaussSeidel;
    }

    p_rghFinal
    {
        solver           GAMG;
        tolerance        1e-7;
        smoother         GaussSeidel;
    }

    omega
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        nSweeps          1;
    }

    omegaFinal
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        nSweeps          1;
    }

    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }
}



PIMPLE
{
    nNonOrthogonalCorrectors 1;
    nCorrectors 2;
    nOuterCorrectors 1;
}

relaxationFactors
{
}

cache
{
    grad(U);
}

// ************************************************************************* //
